<template>
  <div class="pb-6 pb-2 pt-5 pt-md-8" style="font-weight: bolder; color:black; padding:1%">
    <b-card no-body>
      <b-tabs pills card>
        <b-tab title="О листинге" active>
              <h1 style="text-align: center">Что такое листинг</h1>
              <p>
                Если компания заинтересована в привлечении финансовых средств на казахстанском организованном фондовом рынке, ей необходимо пройти процедуру листинга.
              </p>
              <p>
                Листинг – процедура включения ценных бумаг компании в официальный список StockGame - часть списка ценных бумаг, для включения в который и нахождения в нем ценные бумаги и их эмитенты должны соответствовать листинговым требованиям регулятора. Листинг ценных бумаг считается успешно завершенным с даты включения данных ценных бумаг в официальный список StockGame.
              </p>
              <p>
                В случае успешного прохождения процедуры листинга, компания получает статус листинговой компании StockGame
              </p>
              <p>
                После прохождения процедуры листинга компания получает возможность проводить не только частные, но и публичные размещения ценных бумаг в Казахстане, которые обеспечивают приток долгосрочного капитала для финансирования роста и развития компании. Таким образом, листинг на StockGame предоставляет компании постоянный доступ к рынку капитала
              </p>
              <p>
                Инициатором допуска может выступать сама компания или член StockGame. Инициатор допуска является плательщиком листинговых сборов и исполняет обязательства по раскрытию информации об эмитенте и его ценных бумагах на стадии листинга и в течение всего периода нахождения ценных бумаг в официальном списке StockGame.
              </p>

          <h1 style="text-align: center">ПРЕИМУЩЕСТВА ЛИСТИНГА</h1>
          <b-card-group>
            <b-card title="Новый уровень развития">
              <b-card-text>
                При правильном финансовом планировании компания получает возможностьувеличения темпов роста, формируя при этом прозрачную кредитную историю.
              </b-card-text>
            </b-card>

            <b-card title="Диверсификация источников финансирования">
              <b-card-text>
                Увеличивая количество источников финансирования, компания может более эффективно регулировать свои денежные потоки
              </b-card-text>
            </b-card>

            <b-card title="Беззалоговое финансирование">
              <b-card-text>
                Компания имеет возможность привлечь необходимые объемы инвестиций без залога активов
              </b-card-text>
            </b-card>

            <b-card title="Гибкость">
              <b-card-text>
                Компания сама определяет более удобные для нее способы привлечения финансирования: размещение акций или выпуск облигаций. При этом при выпуске облигаций все условия также определяются компанией (срок, ставка вознаграждения, схема погашения и другие условия)
              </b-card-text>
            </b-card>
          </b-card-group>

          <div style="background-color: yellowgreen; text-align: center">
            <p>Список листоговых компании StockApp</p>
            <b-button variant="outline-primary">Посмотреть</b-button>
          </div>
        </b-tab>
        <b-tab title="Листинг на StockApp">
          <b-card title="Акции">
            <ul class="list-group">
              <li class="list-group-item">Дивиденды по простым акциям выплачиваются по решению акционеров</li>
              <li class="list-group-item">Нет обязательств по погашению</li>
              <li class="list-group-item">Не требуется залоговое обеспечение</li>
              <li class="list-group-item">Уменьшение долговой нагрузки</li>
              <li class="list-group-item">Рыночная оценка бизнеса</li>
            </ul>
          </b-card>
          <h1>Основные этапы подготовки</h1>
          <b-tabs card>
            <b-tab title="Шаг 1" active>
              <h1>Выбор финансового инструмента</h1>
              <p>
                Финансовый консультант принимает участие в подготовке документов для регистрации выпуска ценных бумаг эмитента, а также документов для листинга на KASE. Для нефинансовых организаций наличие финансового консультанта обязательно.
              </p>
              <p>
                Финансовый консультант может дополнительно оказывать услуги андеррайтера и маркет-мейкера. При выпуске облигаций дополнительно требуется наличие представителя держателей облигаций.
              </p>
              <b-button variant="outline-primary">Выбрать</b-button>
            </b-tab>
            <b-tab title="Шаг 2">
              <p>
                Для листинга ценных бумаг и в период их нахождения в официальном списке KASE компания обязана проходить ежегодный аудит в одной из аудиторских организаций, входящих в перечень признаваемых KASE аудиторских организаций.
              </p>
              <b-button variant="outline-primary">Выбрать</b-button>
            </b-tab>
            <b-tab title="Шаг 3">
              <h1>Заключение договора с Центральным депозитарием</h1>
              <p>
                В соответствии с Листинговыми правилами KASE, если Компания выпускает ценные бумаги учет данных ценных бумаг должен осуществляться (либо после их выпуска/листинга) в Центральном депозитарии. Компании необходимо заключить договор, заключаемый между Центральным депозитарием и его клиентом, который является договором присоединения.
              </p>
              <p>
                Для присоединения к данному договору необходимо подать заявление на установление деловых отношений с Центральным депозитарием.
              </p>
            </b-tab>
          </b-tabs>

          <b-img width="1600px" height="800px"
            src="img/brand/listing-process.png"/>

        </b-tab>
        <b-tab title="Размещение на StockApp">
          <b-container>
            <div class="accordion" role="tablist">
              <b-card no-body class="mb-1">
                <b-card-header header-tag="header" class="p-1" role="tab">
                  <b-button block v-b-toggle.accordion-1 variant="primary">Специализированные торги</b-button>
                </b-card-header>
                <p>
                  Метод специализированных торгов используется для размещения, продажи, выкупа и приобретения финансового инструмента. Компания (инициатор торгов) определяет только цену размещения и способы удовлетворения заявок, но не вправе ограничивать участие инвесторов каких-либо категорий. Специализированные торги могут проводиться в одну итерацию или более в соответствии с пожеланиями продавца (покупателя). Торги по доразмещению ценных бумаг, размещаемых на специализированных торгах, могут быть проведены только в день аукциона.
                </p>
              </b-card>
              <b-card no-body class="mb-1">
                <b-card-header header-tag="header" class="p-1" role="tab">
                  <b-button block v-b-toggle.accordion-2 variant="primary">Подписка</b-button>
                </b-card-header>
               <p>
                 Метод подписки используется при размещении ценных бумаг и проводится на KASE только при наличии единственного продавца и только при размещении ценных бумаг, которые включены в официальный список Биржи или по которым получено согласие Биржи на их включение в ее официальный список.
               </p>
              </b-card>
              <b-card no-body class="mb-1">
                <b-card-header header-tag="header" class="p-1" role="tab">
                  <b-button block v-b-toggle.accordion-3 variant="primary">Прямая сделка</b-button>
                </b-card-header>
                <p>
                  Метод прямых сделок предполагает, что каждая отдельная сделка заключается в результате проведения переговоров между двумя участниками торгов и достижения ими согласия о заключении между ними данной сделки. Подача участником торгов индикативной котировки не накладывает на него обязательства заключить сделку на основе данной индикативной котировки. При размещении ценных бумаг методом прямых сделок (договорных сделок) отсутствуют налоговые льготы по приросту ценных бумаг, реализованных посредством прямой сделки.
                </p>
              </b-card>
            </div>
          </b-container>
        </b-tab>
      </b-tabs>
    </b-card>
  </div>
</template>

<script>
import ButtonCheckbox from "@/components/ButtonCheckbox";

export default {
  components: {
    ButtonCheckbox
  },
  data()  {
    return {
    text:  `
          Anim pariatur cliche reprehenderit, enim eiusmod high life accusamus terry
          richardson ad squid. 3 wolf moon officia aute, non cupidatat skateboard dolor
          brunch. Food truck quinoa nesciunt laborum eiusmod. Brunch 3 wolf moon
          tempor, sunt aliqua put a bird on it squid single-origin coffee nulla
          assumenda shoreditch et. Nihil anim keffiyeh helvetica, craft beer labore
          wes anderson cred nesciunt sapiente ea proident. Ad vegan excepteur butcher
          vice lomo. Leggings occaecat craft beer farm-to-table, raw denim aesthetic
          synth nesciunt you probably haven't heard of them accusamus labore VHS.
        `
    }
  }
}
</script>

<style>
p {
  font-size: large;
  align-content: center;
  padding: 1%;
}

b-card {
  font-size: xx-large;
}
</style>
